In [1]:
#dtata wrangling
import pandas as pd
import numpy as np
from numpy.random import randn
from pandas import DataFrame, read_csv
import sys

In [4]:
names=['Rishav','Asif','Chirag','Nikhil','Avinash']
births=[100,120,90,45,34]

In [5]:
#to merge these two lists we use zip function
zip?

In [6]:
bd=list(zip(names,births))
bd

[('Rishav', 100),
 ('Asif', 120),
 ('Chirag', 90),
 ('Nikhil', 45),
 ('Avinash', 34)]

In [7]:
df=pd.DataFrame(data=bd)
df

         0    1
0   Rishav  100
1     Asif  120
2   Chirag   90
3   Nikhil   45
4  Avinash   34

In [10]:
df.to_csv('E:\MT4.csv',index=True,header=None)

In [15]:
pd.read_csv('MT4.csv')

   Unnamed: 0        0    1
0           0   Rishav  100
1           1     Asif  120
2           2   Chirag   90
3           3   Nikhil   45
4           4  Avinash   34